Revit 2024 API
RevisionNumberingSequence.SequenceName Property
 The name of this revision numbering sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public string SequenceName { get; set; }
Visual Basic
Public Property SequenceName As String
	Get
	Set
Visual C++
public:
property String^ SequenceName {
	String^ get ();
	void set (String^ value);
}
Remarks
 This name appears in the Sheet Issues/Revisions dialog as a numbering choice for each revision.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: sequenceName is an empty string or contains only whitespace. -or- When setting this property: sequenceName cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace